Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8289207545634207845" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485037127000" -> "1753771421956294000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1371344883919656030" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485663984000" -> "1753771422835728000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.zip" -> "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2025-06-19T04:06:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getRuns",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5419749541747724086" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/878658a187063e4dfad870e9be4e49fd58ec8f23eb5632950dba4c4c8d05184c.zip" -> "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          ~ "timestamp" = "1750304485137967200" -> "1753771422044005000"
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (50 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1347720309274839406" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485973568000" -> "1753771423258560000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (35 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "462147669401431868" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304486047555000" -> "1753771422754932000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2388419891124688641" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485044319000" -> "1753771422251602800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "438465168484.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:43a83a79c2c5c19e5bcf43bd0e773a3ef65107a589cb4a3fff9cc649e8947a79" -> (known after apply)
      ~ last_modified                  = "2025-06-19T02:39:49.156+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
                # (52 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4430933775781765454" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304485847600000" -> "1753771422558038000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/sbeacon.python_libraries_layer/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = null
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/219/default"
                  + module = ".terraform/modules/sbeacon.python_libraries_layer"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = null
          + "source_path"              = "\"sbeacon/layers/python_libraries/\""
        }
      + result  = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ code_sha256                 = "EOKDSFxTuzUkgac0mJ0rzNsJU0AVsvo0Phn/TxWHt/Q=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T03:44:40.795+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply) # forces replacement
      ~ source_code_size            = 23629604 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250619023050292900000004/builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "cbb8e65f657743e88e61ae366e4323cd-5" -> (known after apply)
      ~ id                            = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply)
      ~ key                           = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7702039469218022234" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7beefda982f5be371382d0ff4063670f0aeff8f7b2fa9c29f46b42a0b3a901ba.zip" -> (known after apply)
          ~ "timestamp" = "1750304496717553000" -> (known after apply)
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5" -> (known after apply)
      ~ code_sha256                 = "xv7iHn4X2niBLeSEbPjnqbdewX+Uv/2yPTHTiRwIQ7s=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-19T02:31:55.081+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/685349a484118834b7a875a7953ef58bd17e3547aca46042a2a02abb901d0e41.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 38186 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250619023050292900000004/builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "76945de49ac64d613a9bc6b2b3211652" -> (known after apply)
      ~ id                            = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> (known after apply)
      ~ key                           = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/685349a484118834b7a875a7953ef58bd17e3547aca46042a2a02abb901d0e41.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/685349a484118834b7a875a7953ef58bd17e3547aca46042a2a02abb901d0e41.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/685349a484118834b7a875a7953ef58bd17e3547aca46042a2a02abb901d0e41.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/685349a484118834b7a875a7953ef58bd17e3547aca46042a2a02abb901d0e41.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2724191559089834873" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/da4f8b664b5193994e1fb5583e6dc4eb1812b0438bf4f246d5847c460216eb58.zip" -> "builds/685349a484118834b7a875a7953ef58bd17e3547aca46042a2a02abb901d0e41.zip"
          ~ "timestamp" = "1750304484746220200" -> "1753771422355352000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2222324627247828874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304484883471000" -> "1753771421775377000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0"
        name        = "pgxflow-backend-dbsnp-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
                        ]
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f1a38eccba47d2bd1023f1983c3f584b5b44c41010a0ed2c712070404765931a.zip" -> "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.zip"
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2025-06-19T04:05:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CHR_HEADER"               = "chr"
              - "DBSNP_REFERENCE"          = "dbsnp.vcf.gz"
              - "DPORTAL_BUCKET"           = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "END_HEADER"               = "end"
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"         = "RSJPD_association_matrix.csv"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250619023038383000000003"
              - "PGXFLOW_LOOKUP_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup"
              - "REFERENCE_BUCKET"         = "pgxflow-backend-references-20250619023037268600000002"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"             = "start"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/dbsnp",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5136565656757208500" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f1a38eccba47d2bd1023f1983c3f584b5b44c41010a0ed2c712070404765931a.zip" -> "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.zip"
          ~ "timestamp" = "1750304497641901000" -> "1753771442539446200"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
      - id                = "/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::438465168484:role/pgxflow-backend-lookup-getResultsURL" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-19T02:31:25Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-lookup-getResultsURL" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-lookup-getResultsURL" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAWMFUPQRSEVWE7OHI7" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-lookup-getResultsURL-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                        },
                      - {
                          - Action   = "s3:ListBucket"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-lookup-getResultsURL-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*:*",
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-lookup-getResultsURL:pgxflow-backend-lookup-getResultsURL-0" -> null
      - name        = "pgxflow-backend-lookup-getResultsURL-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-lookup-getResultsURL:pgxflow-backend-lookup-getResultsURL-logs" -> null
      - name        = "pgxflow-backend-lookup-getResultsURL-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*:*",
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-getResultsURL" -> null
      - code_sha256                    = "dVSEgrmq1DFfOCnaZ+zMliQRc1f39f2VZ2G4YKuSENE=" -> null
      - description                    = "Returns presigned results URL for PGxFlow lookup results" -> null
      - filename                       = "builds/636b8f96e7129fe680c90d9ff4d5d2c46663d9bfac629788001912e4a23f410a.zip" -> null
      - function_name                  = "pgxflow-backend-lookup-getResultsURL" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-lookup-getResultsURL" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-getResultsURL/invocations" -> null
      - last_modified                  = "2025-06-19T04:05:00.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-getResultsURL:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-getResultsURL:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::438465168484:role/pgxflow-backend-lookup-getResultsURL" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "dVSEgrmq1DFfOCnaZ+zMliQRc1f39f2VZ2G4YKuSENE=" -> null
      - source_code_size               = 761 -> null
      - tags                           = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DPORTAL_BUCKET"             = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "RESULT_SUFFIX"              = "_lookup_results.jsonl"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "7838893250866447632" -> null
      - triggers = {
          - "filename"  = "builds/636b8f96e7129fe680c90d9ff4d5d2c46663d9bfac629788001912e4a23f410a.zip"
          - "timestamp" = "1750304497633950000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-gnomad:pgxflow-backend-gnomad-0"
        name        = "pgxflow-backend-gnomad-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250619023038383000000003"
              - "RESULT_SUFFIX"            = "_lookup_results.jsonl"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7426655328903675051" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1750304497629376000" -> "1753771442626322000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initLookup" -> null
      - id                = "/aws/lambda/pgxflow-backend-initLookup" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-initLookup" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::438465168484:role/pgxflow-backend-initLookup" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-19T02:31:27Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-initLookup" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-initLookup" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "uat"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAWMFUPQRSJX46VT3W4" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-initLookup-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:ListBucket"
                          - Condition = {
                              - StringLike = {
                                  - "s3:prefix" = "projects/*/project-files/*"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                        },
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
                              - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
                            ]
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail",
                              - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-dbsnp",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-initLookup-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initLookup:*:*",
                              - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initLookup:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-initLookup:pgxflow-backend-initLookup-0" -> null
      - name        = "pgxflow-backend-initLookup-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
                          - "arn:aws:s3:::gaspi-dataportal-20250619023046541400000001/projects/*/project-files/*",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-dbsnp",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initLookup" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-initLookup:pgxflow-backend-initLookup-logs" -> null
      - name        = "pgxflow-backend-initLookup-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initLookup:*:*",
                          - "arn:aws:logs:ap-southeast-3:438465168484:log-group:/aws/lambda/pgxflow-backend-initLookup:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initLookup" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup" -> null
      - code_sha256                    = "E1M8f6hftjGhsIaX0dKlRu3YbiTZqQXiRvsFn+JDyIs=" -> null
      - description                    = "Inititializes a PGxFlow lookup table job" -> null
      - filename                       = "builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.zip" -> null
      - function_name                  = "pgxflow-backend-initLookup" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-initLookup" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup/invocations" -> null
      - last_modified                  = "2025-06-19T04:06:08.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-initLookup:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::438465168484:role/pgxflow-backend-initLookup" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "E1M8f6hftjGhsIaX0dKlRu3YbiTZqQXiRvsFn+JDyIs=" -> null
      - source_code_size               = 1541 -> null
      - tags                           = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "uat"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "CHR_HEADER"                 = "chr"
              - "DYNAMO_CLINIC_JOBS_TABLE"   = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "END_HEADER"                 = "end"
              - "HTS_S3_HOST"                = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"           = "RSJPD_association_matrix.csv"
              - "PGXFLOW_DBSNP_LAMBDA"       = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-dbsnp"
              - "REFERENCE_BUCKET"           = "pgxflow-backend-references-20250619023037268600000002"
              - "SEND_JOB_EMAIL_ARN"         = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"               = "start"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-initLookup" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "979012218675586596" -> null
      - triggers = {
          - "filename"  = "builds/33ca5d9bf1f90b78aa601543d8713042e872e5f98f0d4d91dc9d2b2edea6d2fb.zip"
          - "timestamp" = "1750304497786314000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-lookup:pgxflow-backend-lookup-0"
        name        = "pgxflow-backend-lookup-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002",
                          - "arn:aws:s3:::pgxflow-backend-20250619023038383000000003",
                        ]
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250619023037268600000002/*",
                          - "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250619023038383000000003/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-gnomad",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/53222f8ee608c84de7549e1709f1b8780e1237d60f44caf8c9a02f196239ecd7.zip" -> "builds/e9ef2ac84efe71ccccd9672575c60d6352b47432b558a23c13da9d30cb8e7326.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-06-19T04:05:47.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:438465168484:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CHR_HEADER"               = "chr"
              - "DPORTAL_BUCKET"           = "gaspi-dataportal-20250619023046541400000001"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "END_HEADER"               = "end"
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"         = "RSJPD_association_matrix.csv"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250619023038383000000003"
              - "PGXFLOW_GNOMAD_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-gnomad"
              - "REFERENCE_BUCKET"         = "pgxflow-backend-references-20250619023037268600000002"
              - "RESULT_SUFFIX"            = "_lookup_results.jsonl"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:438465168484:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"            
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.